Summer-16/ARM-Cortex-M0-STM32F070RB/ledmatrix/Src/main.c
/**
  ******************************************************************************
  * File Name          : main.c
  * Description        : Main program body
  ******************************************************************************
  ** This notice applies to any and all portions of this file
  * that are not between comment pairs USER CODE BEGIN and
  * USER CODE END. Other portions of this file, whether 
  * inserted by the user or by software development tools
  * are owned by their respective copyright owners.
  *
  * COPYRIGHT(c) 2017 STMicroelectronics
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "stm32f0xx_hal.h"

/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Private variables ---------------------------------------------------------*/

/* USER CODE BEGIN PV */
/* Private variables ---------------------------------------------------------*/

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);

/* USER CODE BEGIN PFP */
/* Private function prototypes -----------------------------------------------*/

/* USER CODE END PFP */

/* USER CODE BEGIN 0 */

/* USER CODE END 0 */

int main(void)
{

  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration----------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();

  /* USER CODE BEGIN 2 */

  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1)
  {
  /* USER CODE END WHILE */

  /* USER CODE BEGIN 3 */

void prints();
//void printh();
//void printi();
//void printv();
//void printa();
//void printm();
//HAL_GPIO_WritePin(GPIOA,r1_Pin,0);// vertical begin
//HAL_GPIO_WritePin(GPIOA,r2_Pin,1);
//HAL_GPIO_WritePin(GPIOA,r3_Pin,1);
//HAL_GPIO_WritePin(GPIOA,r4_Pin,0);
//HAL_GPIO_WritePin(GPIOA,r5_Pin,0);
//HAL_GPIO_WritePin(GPIOA,r6_Pin,0);
//HAL_GPIO_WritePin(GPIOA,r7_Pin,0);
//HAL_GPIO_WritePin(GPIOA,r8_Pin,0);
//		
//HAL_GPIO_WritePin(GPIOC,c1_Pin,0);
//HAL_GPIO_WritePin(GPIOC,c2_Pin,1);
//HAL_GPIO_WritePin(GPIOC,c3_Pin,1);
//HAL_GPIO_WritePin(GPIOC,c4_Pin,1);
//HAL_GPIO_WritePin(GPIOC,c5_Pin,1);
//HAL_GPIO_WritePin(GPIOC,c6_Pin,1);
//HAL_GPIO_WritePin(GPIOC,c7_Pin,1);
//HAL_GPIO_WritePin(GPIOC,c8_Pin,1);// vertical end
//HAL_Delay(1);
//HAL_GPIO_WritePin(GPIOA,r1_Pin,0);// vertical begin
//HAL_GPIO_WritePin(GPIOA,r2_Pin,0);
//HAL_GPIO_WritePin(GPIOA,r3_Pin,0);
//HAL_GPIO_WritePin(GPIOA,r4_Pin,0);
//HAL_GPIO_WritePin(GPIOA,r5_Pin,1);
//HAL_GPIO_WritePin(GPIOA,r6_Pin,1);
//HAL_GPIO_WritePin(GPIOA,r7_Pin,0);
//HAL_GPIO_WritePin(GPIOA,r8_Pin,0);
//		
//HAL_GPIO_WritePin(GPIOC,c1_Pin,1);
//HAL_GPIO_WritePin(GPIOC,c2_Pin,1);
//HAL_GPIO_WritePin(GPIOC,c3_Pin,1);
//HAL_GPIO_WritePin(GPIOC,c4_Pin,1);
//HAL_GPIO_WritePin(GPIOC,c5_Pin,0);
//HAL_GPIO_WritePin(GPIOC,c6_Pin,1);
//HAL_GPIO_WritePin(GPIOC,c7_Pin,1);
//HAL_GPIO_WritePin(GPIOC,c8_Pin,1);// vertical end
//HAL_Delay(1);
//HAL_GPIO_WritePin(GPIOA,r1_Pin,1);// horizontal begin
//HAL_GPIO_WritePin(GPIOA,r2_Pin,0);
//HAL_GPIO_WritePin(GPIOA,r3_Pin,0);
//HAL_GPIO_WritePin(GPIOA,r4_Pin,1);
//HAL_GPIO_WritePin(GPIOA,r5_Pin,0);
//HAL_GPIO_WritePin(GPIOA,r6_Pin,0);
//HAL_GPIO_WritePin(GPIOA,r7_Pin,1);
//HAL_GPIO_WritePin(GPIOA,r8_Pin,0);

//HAL_GPIO_WritePin(GPIOC,c1_Pin,0);
//HAL_GPIO_WritePin(GPIOC,c2_Pin,0);
//HAL_GPIO_WritePin(GPIOC,c3_Pin,0);
//HAL_GPIO_WritePin(GPIOC,c4_Pin,0);
//HAL_GPIO_WritePin(GPIOC,c5_Pin,0);
//HAL_GPIO_WritePin(GPIOC,c6_Pin,1);
//HAL_GPIO_WritePin(GPIOC,c7_Pin,1);
//HAL_GPIO_WritePin(GPIOC,c8_Pin,1);// horizontal end
//HAL_Delay(1);	
//	
		

	}  
  /* USER CODE END 3 */

}

/** System Clock Configuration
*/
void SystemClock_Config(void)
{

  RCC_OscInitTypeDef RCC_OscInitStruct;
  RCC_ClkInitTypeDef RCC_ClkInitStruct;

    /**Initializes the CPU, AHB and APB busses clocks 
    */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
  RCC_OscInitStruct.HSEState = RCC_HSE_ON;
  RCC_OscInitStruct.HSIState = RCC_HSI_ON;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
  RCC_OscInitStruct.PLL.PLLMUL = RCC_PLL_MUL3;
  RCC_OscInitStruct.PLL.PREDIV = RCC_PREDIV_DIV1;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    _Error_Handler(__FILE__, __LINE__);
  }

    /**Initializes the CPU, AHB and APB busses clocks 
    */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV1;

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_1) != HAL_OK)
  {
    _Error_Handler(__FILE__, __LINE__);
  }

    /**Configure the Systick interrupt time 
    */
  HAL_SYSTICK_Config(HAL_RCC_GetHCLKFreq()/1000);

    /**Configure the Systick 
    */
  HAL_SYSTICK_CLKSourceConfig(SYSTICK_CLKSOURCE_HCLK);

  /* SysTick_IRQn interrupt configuration */
  HAL_NVIC_SetPriority(SysTick_IRQn, 0, 0);
}

/** Configure pins as 
        * Analog 
        * Input 
        * Output
        * EVENT_OUT
        * EXTI
*/
static void MX_GPIO_Init(void)
{

  GPIO_InitTypeDef GPIO_InitStruct;

  /* GPIO Ports Clock Enable */
  __HAL_RCC_GPIOF_CLK_ENABLE();
  __HAL_RCC_GPIOC_CLK_ENABLE();
  __HAL_RCC_GPIOA_CLK_ENABLE();

  /*Configure GPIO pin Output Level */
  HAL_GPIO_WritePin(GPIOC, c1_Pin|c2_Pin|c3_Pin|c4_Pin 
                          |c5_Pin|c6_Pin|c7_Pin|c8_Pin, GPIO_PIN_RESET);

  /*Configure GPIO pin Output Level */
  HAL_GPIO_WritePin(GPIOA, r1_Pin|r2_Pin|r3_Pin|r4_Pin 
                          |r5_Pin|r6_Pin|r7_Pin|r8_Pin, GPIO_PIN_SET);

  /*Configure GPIO pins : c1_Pin c2_Pin c3_Pin c4_Pin 
                           c5_Pin c6_Pin c7_Pin c8_Pin */
  GPIO_InitStruct.Pin = c1_Pin|c2_Pin|c3_Pin|c4_Pin 
                          |c5_Pin|c6_Pin|c7_Pin|c8_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);

  /*Configure GPIO pins : r1_Pin r2_Pin r3_Pin r4_Pin 
                           r5_Pin r6_Pin r7_Pin r8_Pin */
  GPIO_InitStruct.Pin = r1_Pin|r2_Pin|r3_Pin|r4_Pin 
                          |r5_Pin|r6_Pin|r7_Pin|r8_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

}

/* USER CODE BEGIN 4 */
void printa()
{
for(int i=100;i>0;i--)//A
{
HAL_GPIO_WritePin(GPIOA,r1_Pin,1);// vertical begin
HAL_GPIO_WritePin(GPIOA,r2_Pin,1);
HAL_GPIO_WritePin(GPIOA,r3_Pin,1);
HAL_GPIO_WritePin(GPIOA,r4_Pin,1);
HAL_GPIO_WritePin(GPIOA,r5_Pin,1);
HAL_GPIO_WritePin(GPIOA,r6_Pin,1);
HAL_GPIO_WritePin(GPIOA,r7_Pin,1);
HAL_GPIO_WritePin(GPIOA,r8_Pin,1);
		
HAL_GPIO_WritePin(GPIOC,c1_Pin,0);
HAL_GPIO_WritePin(GPIOC,c2_Pin,1);
HAL_GPIO_WritePin(GPIOC,c3_Pin,1);
HAL_GPIO_WritePin(GPIOC,c4_Pin,1);
HAL_GPIO_WritePin(GPIOC,c5_Pin,0);
HAL_GPIO_WritePin(GPIOC,c6_Pin,1);
HAL_GPIO_WritePin(GPIOC,c7_Pin,1);
HAL_GPIO_WritePin(GPIOC,c8_Pin,1);// vertical end
HAL_Delay(1);
HAL_GPIO_WritePin(GPIOA,r1_Pin,1);// horizontal begin
HAL_GPIO_WritePin(GPIOA,r2_Pin,0);
HAL_GPIO_WritePin(GPIOA,r3_Pin,0);
HAL_GPIO_WritePin(GPIOA,r4_Pin,0);
HAL_GPIO_WritePin(GPIOA,r5_Pin,1);
HAL_GPIO_WritePin(GPIOA,r6_Pin,0);
HAL_GPIO_WritePin(GPIOA,r7_Pin,0);
HAL_GPIO_WritePin(GPIOA,r8_Pin,0);

HAL_GPIO_WritePin(GPIOC,c1_Pin,0);
HAL_GPIO_WritePin(GPIOC,c2_Pin,0);
HAL_GPIO_WritePin(GPIOC,c3_Pin,0);
HAL_GPIO_WritePin(GPIOC,c4_Pin,0);
HAL_GPIO_WritePin(GPIOC,c5_Pin,0);
HAL_GPIO_WritePin(GPIOC,c6_Pin,1);
HAL_GPIO_WritePin(GPIOC,c7_Pin,1);
HAL_GPIO_WritePin(GPIOC,c8_Pin,1);// horizontal end
HAL_Delay(1);	
}	
}

void prints()
{
for(int i=100;i>0;i--)//S
{	
HAL_GPIO_WritePin(GPIOA,r1_Pin,0);// vertical begin
HAL_GPIO_WritePin(GPIOA,r2_Pin,1);
HAL_GPIO_WritePin(GPIOA,r3_Pin,1);
HAL_GPIO_WritePin(GPIOA,r4_Pin,0);
HAL_GPIO_WritePin(GPIOA,r5_Pin,0);
HAL_GPIO_WritePin(GPIOA,r6_Pin,0);
HAL_GPIO_WritePin(GPIOA,r7_Pin,0);
HAL_GPIO_WritePin(GPIOA,r8_Pin,0);
		
HAL_GPIO_WritePin(GPIOC,c1_Pin,0);
HAL_GPIO_WritePin(GPIOC,c2_Pin,1);
HAL_GPIO_WritePin(GPIOC,c3_Pin,1);
HAL_GPIO_WritePin(GPIOC,c4_Pin,1);
HAL_GPIO_WritePin(GPIOC,c5_Pin,1);
HAL_GPIO_WritePin(GPIOC,c6_Pin,1);
HAL_GPIO_WritePin(GPIOC,c7_Pin,1);
HAL_GPIO_WritePin(GPIOC,c8_Pin,1);// vertical end
HAL_Delay(1);
HAL_GPIO_WritePin(GPIOA,r1_Pin,0);// vertical begin
HAL_GPIO_WritePin(GPIOA,r2_Pin,0);
HAL_GPIO_WritePin(GPIOA,r3_Pin,0);
HAL_GPIO_WritePin(GPIOA,r4_Pin,0);
HAL_GPIO_WritePin(GPIOA,r5_Pin,1);
HAL_GPIO_WritePin(GPIOA,r6_Pin,1);
HAL_GPIO_WritePin(GPIOA,r7_Pin,0);
HAL_GPIO_WritePin(GPIOA,r8_Pin,0);
		
HAL_GPIO_WritePin(GPIOC,c1_Pin,1);
HAL_GPIO_WritePin(GPIOC,c2_Pin,1);
HAL_GPIO_WritePin(GPIOC,c3_Pin,1);
HAL_GPIO_WritePin(GPIOC,c4_Pin,1);
HAL_GPIO_WritePin(GPIOC,c5_Pin,0);
HAL_GPIO_WritePin(GPIOC,c6_Pin,1);
HAL_GPIO_WritePin(GPIOC,c7_Pin,1);
HAL_GPIO_WritePin(GPIOC,c8_Pin,1);// vertical end
HAL_Delay(1);
HAL_GPIO_WritePin(GPIOA,r1_Pin,1);// horizontal begin
HAL_GPIO_WritePin(GPIOA,r2_Pin,0);
HAL_GPIO_WritePin(GPIOA,r3_Pin,0);
HAL_GPIO_WritePin(GPIOA,r4_Pin,1);
HAL_GPIO_WritePin(GPIOA,r5_Pin,0);
HAL_GPIO_WritePin(GPIOA,r6_Pin,0);
HAL_GPIO_WritePin(GPIOA,r7_Pin,1);
HAL_GPIO_WritePin(GPIOA,r8_Pin,0);

HAL_GPIO_WritePin(GPIOC,c1_Pin,0);
HAL_GPIO_WritePin(GPIOC,c2_Pin,0);
HAL_GPIO_WritePin(GPIOC,c3_Pin,0);
HAL_GPIO_WritePin(GPIOC,c4_Pin,0);
HAL_GPIO_WritePin(GPIOC,c5_Pin,0);
HAL_GPIO_WritePin(GPIOC,c6_Pin,1);
HAL_GPIO_WritePin(GPIOC,c7_Pin,1);
HAL_GPIO_WritePin(GPIOC,c8_Pin,1);// horizontal end
HAL_Delay(1);	
}
}
void printh()
{
	for(int i=100;i>0;i--)//H
{
HAL_GPIO_WritePin(GPIOA,r1_Pin,1);// vertical begin
HAL_GPIO_WritePin(GPIOA,r2_Pin,1);
HAL_GPIO_WritePin(GPIOA,r3_Pin,1);
HAL_GPIO_WritePin(GPIOA,r4_Pin,1);
HAL_GPIO_WritePin(GPIOA,r5_Pin,1);
HAL_GPIO_WritePin(GPIOA,r6_Pin,1);
HAL_GPIO_WritePin(GPIOA,r7_Pin,1);
HAL_GPIO_WritePin(GPIOA,r8_Pin,0);
		
HAL_GPIO_WritePin(GPIOC,c1_Pin,0);
HAL_GPIO_WritePin(GPIOC,c2_Pin,1);
HAL_GPIO_WritePin(GPIOC,c3_Pin,1);
HAL_GPIO_WritePin(GPIOC,c4_Pin,1);
HAL_GPIO_WritePin(GPIOC,c5_Pin,0);
HAL_GPIO_WritePin(GPIOC,c6_Pin,1);
HAL_GPIO_WritePin(GPIOC,c7_Pin,1);
HAL_GPIO_WritePin(GPIOC,c8_Pin,1);// vertical end
HAL_Delay(1);

HAL_GPIO_WritePin(GPIOA,r1_Pin,0);// horizontal begin
HAL_GPIO_WritePin(GPIOA,r2_Pin,0);
HAL_GPIO_WritePin(GPIOA,r3_Pin,0);
HAL_GPIO_WritePin(GPIOA,r4_Pin,1);
HAL_GPIO_WritePin(GPIOA,r5_Pin,0);
HAL_GPIO_WritePin(GPIOA,r6_Pin,0);
HAL_GPIO_WritePin(GPIOA,r7_Pin,0);
HAL_GPIO_WritePin(GPIOA,r8_Pin,0);

HAL_GPIO_WritePin(GPIOC,c1_Pin,1);
HAL_GPIO_WritePin(GPIOC,c2_Pin,0);
HAL_GPIO_WritePin(GPIOC,c3_Pin,0);
HAL_GPIO_WritePin(GPIOC,c4_Pin,0);
HAL_GPIO_WritePin(GPIOC,c5_Pin,1);
HAL_GPIO_WritePin(GPIOC,c6_Pin,1);
HAL_GPIO_WritePin(GPIOC,c7_Pin,1);
HAL_GPIO_WritePin(GPIOC,c8_Pin,1);// horizontal end
HAL_Delay(1);	
}
}
void printi()
{
for(int i=100;i>0;i--)//I
{
HAL_GPIO_WritePin(GPIOA,r1_Pin,0);// vertical begin
HAL_GPIO_WritePin(GPIOA,r2_Pin,1);
HAL_GPIO_WritePin(GPIOA,r3_Pin,1);
HAL_GPIO_WritePin(GPIOA,r4_Pin,1);
HAL_GPIO_WritePin(GPIOA,r5_Pin,1);
HAL_GPIO_WritePin(GPIOA,r6_Pin,1);
HAL_GPIO_WritePin(GPIOA,r7_Pin,0);
HAL_GPIO_WritePin(GPIOA,r8_Pin,0);
		
HAL_GPIO_WritePin(GPIOC,c1_Pin,1);
HAL_GPIO_WritePin(GPIOC,c2_Pin,1);
HAL_GPIO_WritePin(GPIOC,c3_Pin,0);
HAL_GPIO_WritePin(GPIOC,c4_Pin,1);
HAL_GPIO_WritePin(GPIOC,c5_Pin,1);
HAL_GPIO_WritePin(GPIOC,c6_Pin,1);
HAL_GPIO_WritePin(GPIOC,c7_Pin,1);
HAL_GPIO_WritePin(GPIOC,c8_Pin,1);// vertical end
HAL_Delay(1);

HAL_GPIO_WritePin(GPIOA,r1_Pin,1);// horizontal begin
HAL_GPIO_WritePin(GPIOA,r2_Pin,0);
HAL_GPIO_WritePin(GPIOA,r3_Pin,0);
HAL_GPIO_WritePin(GPIOA,r4_Pin,0);
HAL_GPIO_WritePin(GPIOA,r5_Pin,0);
HAL_GPIO_WritePin(GPIOA,r6_Pin,0);
HAL_GPIO_WritePin(GPIOA,r7_Pin,1);
HAL_GPIO_WritePin(GPIOA,r8_Pin,0);

HAL_GPIO_WritePin(GPIOC,c1_Pin,0);
HAL_GPIO_WritePin(GPIOC,c2_Pin,0);
HAL_GPIO_WritePin(GPIOC,c3_Pin,0);
HAL_GPIO_WritePin(GPIOC,c4_Pin,0);
HAL_GPIO_WritePin(GPIOC,c5_Pin,0);
HAL_GPIO_WritePin(GPIOC,c6_Pin,1);
HAL_GPIO_WritePin(GPIOC,c7_Pin,1);
HAL_GPIO_WritePin(GPIOC,c8_Pin,1);// horizontal end
HAL_Delay(1);	
}
}
void printv()
{
for(int i=100;i>0;i--)//V
{
HAL_GPIO_WritePin(GPIOA,r1_Pin,1);// vertical begin
HAL_GPIO_WritePin(GPIOA,r2_Pin,1);
HAL_GPIO_WritePin(GPIOA,r3_Pin,1);
HAL_GPIO_WritePin(GPIOA,r4_Pin,1);
HAL_GPIO_WritePin(GPIOA,r5_Pin,1);
HAL_GPIO_WritePin(GPIOA,r6_Pin,0);
HAL_GPIO_WritePin(GPIOA,r7_Pin,0);
HAL_GPIO_WritePin(GPIOA,r8_Pin,0);
		
HAL_GPIO_WritePin(GPIOC,c1_Pin,0);
HAL_GPIO_WritePin(GPIOC,c2_Pin,1);
HAL_GPIO_WritePin(GPIOC,c3_Pin,1);
HAL_GPIO_WritePin(GPIOC,c4_Pin,1);
HAL_GPIO_WritePin(GPIOC,c5_Pin,0);
HAL_GPIO_WritePin(GPIOC,c6_Pin,1);
HAL_GPIO_WritePin(GPIOC,c7_Pin,1);
HAL_GPIO_WritePin(GPIOC,c8_Pin,1);// vertical end
HAL_Delay(1);

HAL_GPIO_WritePin(GPIOA,r1_Pin,0);// horizontal begin
HAL_GPIO_WritePin(GPIOA,r2_Pin,0);
HAL_GPIO_WritePin(GPIOA,r3_Pin,0);
HAL_GPIO_WritePin(GPIOA,r4_Pin,0);
HAL_GPIO_WritePin(GPIOA,r5_Pin,0);
HAL_GPIO_WritePin(GPIOA,r6_Pin,1);
HAL_GPIO_WritePin(GPIOA,r7_Pin,0);
HAL_GPIO_WritePin(GPIOA,r8_Pin,0);

HAL_GPIO_WritePin(GPIOC,c1_Pin,1);
HAL_GPIO_WritePin(GPIOC,c2_Pin,0);
HAL_GPIO_WritePin(GPIOC,c3_Pin,1);
HAL_GPIO_WritePin(GPIOC,c4_Pin,0);
HAL_GPIO_WritePin(GPIOC,c5_Pin,1);
HAL_GPIO_WritePin(GPIOC,c6_Pin,1);
HAL_GPIO_WritePin(GPIOC,c7_Pin,1);
HAL_GPIO_WritePin(GPIOC,c8_Pin,1);// horizontal end
HAL_Delay(1);	

HAL_GPIO_WritePin(GPIOA,r1_Pin,0);// horizontal begin
HAL_GPIO_WritePin(GPIOA,r2_Pin,0);
HAL_GPIO_WritePin(GPIOA,r3_Pin,0);
HAL_GPIO_WritePin(GPIOA,r4_Pin,0);
HAL_GPIO_WritePin(GPIOA,r5_Pin,0);
HAL_GPIO_WritePin(GPIOA,r6_Pin,0);
HAL_GPIO_WritePin(GPIOA,r7_Pin,1);
HAL_GPIO_WritePin(GPIOA,r8_Pin,0);

HAL_GPIO_WritePin(GPIOC,c1_Pin,1);
HAL_GPIO_WritePin(GPIOC,c2_Pin,1);
HAL_GPIO_WritePin(GPIOC,c3_Pin,0);
HAL_GPIO_WritePin(GPIOC,c4_Pin,1);
HAL_GPIO_WritePin(GPIOC,c5_Pin,1);
HAL_GPIO_WritePin(GPIOC,c6_Pin,1);
HAL_GPIO_WritePin(GPIOC,c7_Pin,1);
HAL_GPIO_WritePin(GPIOC,c8_Pin,1);// horizontal end
HAL_Delay(1);	
}
}
void printm()
{
for(int i=100;i>0;i--)//M
{
HAL_GPIO_WritePin(GPIOA,r1_Pin,1);// vertical begin
HAL_GPIO_WritePin(GPIOA,r2_Pin,1);
HAL_GPIO_WritePin(GPIOA,r3_Pin,1);
HAL_GPIO_WritePin(GPIOA,r4_Pin,1);
HAL_GPIO_WritePin(GPIOA,r5_Pin,1);
HAL_GPIO_WritePin(GPIOA,r6_Pin,1);
HAL_GPIO_WritePin(GPIOA,r7_Pin,1);
HAL_GPIO_WritePin(GPIOA,r8_Pin,0);
		
HAL_GPIO_WritePin(GPIOC,c1_Pin,0);
HAL_GPIO_WritePin(GPIOC,c2_Pin,1);
HAL_GPIO_WritePin(GPIOC,c3_Pin,1);
HAL_GPIO_WritePin(GPIOC,c4_Pin,1);
HAL_GPIO_WritePin(GPIOC,c5_Pin,0);
HAL_GPIO_WritePin(GPIOC,c6_Pin,1);
HAL_GPIO_WritePin(GPIOC,c7_Pin,1);
HAL_GPIO_WritePin(GPIOC,c8_Pin,1);// vertical end
HAL_Delay(1);

HAL_GPIO_WritePin(GPIOA,r1_Pin,0);// horizontal begin
HAL_GPIO_WritePin(GPIOA,r2_Pin,1);
HAL_GPIO_WritePin(GPIOA,r3_Pin,0);
HAL_GPIO_WritePin(GPIOA,r4_Pin,0);
HAL_GPIO_WritePin(GPIOA,r5_Pin,0);
HAL_GPIO_WritePin(GPIOA,r6_Pin,0);
HAL_GPIO_WritePin(GPIOA,r7_Pin,0);
HAL_GPIO_WritePin(GPIOA,r8_Pin,0);

HAL_GPIO_WritePin(GPIOC,c1_Pin,1);
HAL_GPIO_WritePin(GPIOC,c2_Pin,0);
HAL_GPIO_WritePin(GPIOC,c3_Pin,1);
HAL_GPIO_WritePin(GPIOC,c4_Pin,0);
HAL_GPIO_WritePin(GPIOC,c5_Pin,1);
HAL_GPIO_WritePin(GPIOC,c6_Pin,1);
HAL_GPIO_WritePin(GPIOC,c7_Pin,1);
HAL_GPIO_WritePin(GPIOC,c8_Pin,1);// horizontal end
HAL_Delay(1);	

HAL_GPIO_WritePin(GPIOA,r1_Pin,0);// horizontal begin
HAL_GPIO_WritePin(GPIOA,r2_Pin,0);
HAL_GPIO_WritePin(GPIOA,r3_Pin,1);
HAL_GPIO_WritePin(GPIOA,r4_Pin,0);
HAL_GPIO_WritePin(GPIOA,r5_Pin,0);
HAL_GPIO_WritePin(GPIOA,r6_Pin,0);
HAL_GPIO_WritePin(GPIOA,r7_Pin,0);
HAL_GPIO_WritePin(GPIOA,r8_Pin,0);

HAL_GPIO_WritePin(GPIOC,c1_Pin,1);
HAL_GPIO_WritePin(GPIOC,c2_Pin,1);
HAL_GPIO_WritePin(GPIOC,c3_Pin,0);
HAL_GPIO_WritePin(GPIOC,c4_Pin,1);
HAL_GPIO_WritePin(GPIOC,c5_Pin,1);
HAL_GPIO_WritePin(GPIOC,c6_Pin,1);
HAL_GPIO_WritePin(GPIOC,c7_Pin,1);
HAL_GPIO_WritePin(GPIOC,c8_Pin,1);// horizontal end
HAL_Delay(1);	
}
}

void printb()
{
for(int i=100;i>0;i--)//B
{
HAL_GPIO_WritePin(GPIOA,r1_Pin,1);// vertical begin
HAL_GPIO_WritePin(GPIOA,r2_Pin,1);
HAL_GPIO_WritePin(GPIOA,r3_Pin,1);
HAL_GPIO_WritePin(GPIOA,r4_Pin,1);
HAL_GPIO_WritePin(GPIOA,r5_Pin,1);
HAL_GPIO_WritePin(GPIOA,r6_Pin,1);
HAL_GPIO_WritePin(GPIOA,r7_Pin,1);
HAL_GPIO_WritePin(GPIOA,r8_Pin,1);
		
HAL_GPIO_WritePin(GPIOC,c1_Pin,0);
HAL_GPIO_WritePin(GPIOC,c2_Pin,1);
HAL_GPIO_WritePin(GPIOC,c3_Pin,1);
HAL_GPIO_WritePin(GPIOC,c4_Pin,1);
HAL_GPIO_WritePin(GPIOC,c5_Pin,1);
HAL_GPIO_WritePin(GPIOC,c6_Pin,1);
HAL_GPIO_WritePin(GPIOC,c7_Pin,1);
HAL_GPIO_WritePin(GPIOC,c8_Pin,1);// vertical end
HAL_Delay(1);
HAL_GPIO_WritePin(GPIOA,r1_Pin,0);// horizontal begin
HAL_GPIO_WritePin(GPIOA,r2_Pin,1);
HAL_GPIO_WritePin(GPIOA,r3_Pin,1);
HAL_GPIO_WritePin(GPIOA,r4_Pin,0);
HAL_GPIO_WritePin(GPIOA,r5_Pin,1);
HAL_GPIO_WritePin(GPIOA,r6_Pin,1);
HAL_GPIO_WritePin(GPIOA,r7_Pin,1);
HAL_GPIO_WritePin(GPIOA,r8_Pin,0);

HAL_GPIO_WritePin(GPIOC,c1_Pin,1);
HAL_GPIO_WritePin(GPIOC,c2_Pin,1);
HAL_GPIO_WritePin(GPIOC,c3_Pin,1);
HAL_GPIO_WritePin(GPIOC,c4_Pin,1);
HAL_GPIO_WritePin(GPIOC,c5_Pin,0);
HAL_GPIO_WritePin(GPIOC,c6_Pin,1);
HAL_GPIO_WritePin(GPIOC,c7_Pin,1);
HAL_GPIO_WritePin(GPIOC,c8_Pin,1);// horizontal end
HAL_Delay(1);	

HAL_GPIO_WritePin(GPIOA,r1_Pin,1);// vertical begin
HAL_GPIO_WritePin(GPIOA,r2_Pin,0);
HAL_GPIO_WritePin(GPIOA,r3_Pin,0);
HAL_GPIO_WritePin(GPIOA,r4_Pin,1);
HAL_GPIO_WritePin(GPIOA,r5_Pin,0);
HAL_GPIO_WritePin(GPIOA,r6_Pin,0);
HAL_GPIO_WritePin(GPIOA,r7_Pin,0);
HAL_GPIO_WritePin(GPIOA,r8_Pin,1);
		
HAL_GPIO_WritePin(GPIOC,c1_Pin,1);
HAL_GPIO_WritePin(GPIOC,c2_Pin,0);
HAL_GPIO_WritePin(GPIOC,c3_Pin,0);
HAL_GPIO_WritePin(GPIOC,c4_Pin,0);
HAL_GPIO_WritePin(GPIOC,c5_Pin,1);
HAL_GPIO_WritePin(GPIOC,c6_Pin,1);
HAL_GPIO_WritePin(GPIOC,c7_Pin,1);
HAL_GPIO_WritePin(GPIOC,c8_Pin,1);// vertical end
HAL_Delay(1);}
}

void print8()
{
for(int i=100;i>0;i--)//8
{
HAL_GPIO_WritePin(GPIOA,r1_Pin,0);// vertical begin
HAL_GPIO_WritePin(GPIOA,r2_Pin,1);
HAL_GPIO_WritePin(GPIOA,r3_Pin,1);
HAL_GPIO_WritePin(GPIOA,r4_Pin,0);
HAL_GPIO_WritePin(GPIOA,r5_Pin,1);
HAL_GPIO_WritePin(GPIOA,r6_Pin,1);
HAL_GPIO_WritePin(GPIOA,r7_Pin,0);
HAL_GPIO_WritePin(GPIOA,r8_Pin,0);
		
HAL_GPIO_WritePin(GPIOC,c1_Pin,0);
HAL_GPIO_WritePin(GPIOC,c2_Pin,1);
HAL_GPIO_WritePin(GPIOC,c3_Pin,1);
HAL_GPIO_WritePin(GPIOC,c4_Pin,1);
HAL_GPIO_WritePin(GPIOC,c5_Pin,0);
HAL_GPIO_WritePin(GPIOC,c6_Pin,1);
HAL_GPIO_WritePin(GPIOC,c7_Pin,1);
HAL_GPIO_WritePin(GPIOC,c8_Pin,1);// vertical end
HAL_Delay(1);
HAL_GPIO_WritePin(GPIOA,r1_Pin,1);// horizontal begin
HAL_GPIO_WritePin(GPIOA,r2_Pin,0);
HAL_GPIO_WritePin(GPIOA,r3_Pin,0);
HAL_GPIO_WritePin(GPIOA,r4_Pin,1);
HAL_GPIO_WritePin(GPIOA,r5_Pin,0);
HAL_GPIO_WritePin(GPIOA,r6_Pin,0);
HAL_GPIO_WritePin(GPIOA,r7_Pin,1);
HAL_GPIO_WritePin(GPIOA,r8_Pin,0);

HAL_GPIO_WritePin(GPIOC,c1_Pin,0);
HAL_GPIO_WritePin(GPIOC,c2_Pin,0);
HAL_GPIO_WritePin(GPIOC,c3_Pin,0);
HAL_GPIO_WritePin(GPIOC,c4_Pin,0);
HAL_GPIO_WritePin(GPIOC,c5_Pin,0);
HAL_GPIO_WritePin(GPIOC,c6_Pin,1);
HAL_GPIO_WritePin(GPIOC,c7_Pin,1);
HAL_GPIO_WritePin(GPIOC,c8_Pin,1);// horizontal end
HAL_Delay(1);}
}
/* USER CODE END 4 */

/**
  * @brief  This function is executed in case of error occurrence.
  * @param  None
  * @retval None
  */
void _Error_Handler(char * file, int line)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  while(1) 
  {
  }
  /* USER CODE END Error_Handler_Debug */ 
}

#ifdef USE_FULL_ASSERT

/**
   * @brief Reports the name of the source file and the source line number
   * where the assert_param error has occurred.
   * @param file: pointer to the source file name
   * @param line: assert_param error line source number
   * @retval None
   */
void assert_failed(uint8_t* file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
    ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */

}

#endif

/**
  * @}
  */ 

/**
  * @}
*/ 

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
